// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Arabic (`ar`).
class AppLocalizationsAr extends AppLocalizations {
  AppLocalizationsAr([String locale = 'ar']) : super(locale);

  @override
  String get hello => 'مرحبا';

  @override
  String get welcome => 'مرحبًا بك !';

  @override
  String get logout => 'تسجيل الخروج';

  @override
  String get settings => 'الإعدادات';

  @override
  String get language => 'اللغة';

  @override
  String get oneStopShopDescription =>
      'نحن متجرك الإلكتروني الشامل لكل ما تحتاج إليه.  توصيل سريع، أسعار رائعة، وعلامات تجارية موثوقة   كلها في مكان واحد..';

  @override
  String get login => 'تسجيل الدخول';

  @override
  String get create => 'إنشاء حساب';

  @override
  String get back => 'الرجوع';

  @override
  String get usernameOrEmail => 'اسم المستخدم أو البريد الإلكتروني';

  @override
  String get password => 'كلمة المرور';

  @override
  String get forgotPwd => 'هل نسيت \nكلمة المرور؟';

  @override
  String get continueWith => '- أو تابع باستخدام -';

  @override
  String get createAnAccount => 'إنشاء \nحساب';

  @override
  String get signUp => 'تسجيل';

  @override
  String get createAccount => 'create an account';

  @override
  String get anAccount => 'حساب';

  @override
  String get welcomeBack => 'مرحبًا \nبعودتك!';

  @override
  String get firstName => 'الاسم';

  @override
  String get lastName => 'اللقب';

  @override
  String get createSimple => 'إنشاء';

  @override
  String get createAnAccountLogin => 'إنشاء حساب';

  @override
  String get email => 'البريد الالكتروني';

  @override
  String get phone => 'رقم الهاتف';

  @override
  String get passworConfirmation => 'تأكيد كلمة المرور';

  @override
  String get becomeASeller => 'هل تريد أن تصبح بائعًا / بائعة؟';

  @override
  String get yes => 'نعم';

  @override
  String get no => 'لا';

  @override
  String get byClickingThe => 'بالنقر على زر';

  @override
  String get publicOffer => '، فإنك توافق على العرض العام';

  @override
  String get newsletter => 'اشترك في النشرة الإخبارية';

  @override
  String get enableremoteshoppinghelp => 'السماح بمساعدة التسوق عن بُعد';

  @override
  String get alreadyHaveAnAccount => 'لدي حساب بالفعل ';

  @override
  String get enterEmail => 'أدخل عنوان بريدك الإلكتروني';

  @override
  String get resetPwd =>
      '* سوف نرسل لك رسالة لتعيين أو إعادة تعيين كلمة المرور الجديدة';

  @override
  String get submit => 'إرسال';

  @override
  String get verificationCode => 'رمز\n التحقق';

  @override
  String get sentTheVerificationCode => 'لقد أرسلنا رمز التحقق إلى';

  @override
  String get noCode => 'لم تستلم الرمز ؟';

  @override
  String get resend => ' أعد الإرسال';

  @override
  String get general => 'عام';

  @override
  String get editProfile => 'تعديل الملف الشخصي';

  @override
  String get notification => 'الإشعار';

  @override
  String get favourites => 'المفضلة';

  @override
  String get myOrders => 'طلباتي';

  @override
  String get performances => 'الأداء';

  @override
  String get legalAndPolicies => 'القوانين والسياسات';

  @override
  String get helpSupport => 'المساعدة والدعم';

  @override
  String get trailLanguage => 'العربية';

  @override
  String get personalInfo => 'المعلومات الشخصية';

  @override
  String get paymentMethod => 'طريقة الدفع';

  @override
  String get shippingAddress => 'عنوان الشحن';

  @override
  String get streetAddress => 'عنوان الشارع';

  @override
  String get city => 'المدينة';

  @override
  String get zipPostalCode => 'الرمز البريدي';

  @override
  String get required => 'اجباري';

  @override
  String get invalidCode => 'رمز خاطئ';

  @override
  String get country => 'الدولة';

  @override
  String get card => 'البطاقة';

  @override
  String get payPal => 'باي بال';

  @override
  String get applePay => 'آبل باي';

  @override
  String get cardholderName => 'اسم صاحب الحساب';

  @override
  String get cardNumber => 'رقم حساب البنك';

  @override
  String get expiry => 'تاريخ الصلاحية (MM/YY)';

  @override
  String get next => 'التالي';

  @override
  String get save => 'حفظ';

  @override
  String get passwordChangedSuccessfully => 'تم تغيير كلمة المرور بنجاح';

  @override
  String get changePassword => 'تغيير كلمة المرور';

  @override
  String get oldPassword => 'كلمة المرور القديمة';

  @override
  String get enteryourcurrentpassword => 'أدخل كلمة المرور الحالية';

  @override
  String get reenternewpassword => 'أعد إدخال كلمة المرور الجديدة';

  @override
  String get confirmPassword => 'تأكيد كلمة المرور';

  @override
  String get changeNow => 'غيّر الآن';

  @override
  String get newPassword => 'كلمة المرور الجديدة';

  @override
  String get enternewpassword => 'أدخل كلمة المرور الجديدة';

  @override
  String get purchaseCompleted => 'تم إكمال الشراء';

  @override
  String get orderPacked => 'تم تجهيز الطلب';

  @override
  String get minago => 'منذ دقيقة';

  @override
  String get today => 'اليوم';

  @override
  String get yesterday => 'أمس';

  @override
  String get discountApplied => 'تم تطبيق الخصم';

  @override
  String get newFeatureUpdate => 'تحديث الميزة الجديدة';

  @override
  String get searchFavorites => 'ابحث في المفضلة';

  @override
  String get productDescription => 'وصف تجريبي للمنتج يظهر هنا.';

  @override
  String get currentPrice => '٤٩٩ درهم';

  @override
  String get originalPrice => '٩٩٩ درهم';

  @override
  String get discount => 'خصم ٥٠٪';

  @override
  String get product0Name => 'أحذية نايكي للجري';

  @override
  String get product1Name => 'أحذية أديداس الرياضية';

  @override
  String get product2Name => 'أحذية بوما الكاجوال';

  @override
  String get product3Name => 'أحذية ريبوك الرياضية';

  @override
  String get product4Name => 'أحذية نيو بالانس للمشي';

  @override
  String get product5Name => 'أحذية آسكس للماراثون';

  @override
  String get search => 'بحث';

  @override
  String get english => 'الإنجليزية';

  @override
  String get arabic => 'العربية';

  @override
  String get privacyPolicy => 'سياسة الخصوصية';

  @override
  String get humanFriendly => 'المقدمة والتعريف بسياستنا';

  @override
  String get legalMumboJumbo => 'تفاصيل سياستنا وأحكامها';

  @override
  String get privacyDescription =>
      'تسود شروط الخدمة بلغة بسيطة على الشروط القانونية التفصيلية، التي تحدد الحقوق والالتزامات بلغة قانونية معقدة.\n\nفي حال وجود تناقض بين الوثيقتين، فإن شروط الخدمة بلغة بسيطة هي التي تُعتمد. هذا يعني عدم وجود مفاجآت غير سارة إذا قرأت النسخة المبسطة فقط.';

  @override
  String get lastUpdated => 'آخر تحديث';

  @override
  String get helpAndSupport => 'المساعدة والدعم';

  @override
  String get searchTopics => 'ابحث عن المواضيع...';

  @override
  String get helpTopic0 => 'كيف يمكن إنشاء حساب على موقع كولشي؟';

  @override
  String get helpTopic1 => 'طرق الدفع؟';

  @override
  String get helpTopic2 => 'تتبع الطلب من البائع؟';

  @override
  String get helpTopic3 => 'تتبع الطلب للعميل؟';

  @override
  String get helpTopic4 => 'ما هي سياسة الإرجاع الخاصة بكم؟';

  @override
  String get helpTopicContent => ' ';

  @override
  String get messages => 'الرسائل';

  @override
  String get sendHint => 'أرسل رسالة هنا...';

  @override
  String get presetFasterDelivery => 'وقت توصيل أسرع';

  @override
  String get presetProductIssue => 'مشكلة في المنتج';

  @override
  String get presetOther => 'شيء آخر...';

  @override
  String get thankYouTitle => 'شكرًا لتسوقك معنا!';

  @override
  String get thankYouSubtitle => 'طلبك رقم 16 تم تأكيده\nوجاري معالجته';

  @override
  String get thankYouDescription =>
      'لوريم إيبسوم هو ببساطة نص شكلي يستخدم في الطباعة. يتميز بسهولة القراءة ويحتوي على عناصر تنسيقية مريحة للعين.';

  @override
  String get orderDetails => 'تفاصيل الطلب';

  @override
  String get done => 'تم';

  @override
  String get orderSummary => 'ملخص الطلب';

  @override
  String get orderNumber => 'رقم الطلب';

  @override
  String get orderDate => 'التاريخ';

  @override
  String get orderStatus => 'الحالة';

  @override
  String get statusConfirmed => 'تم التأكيد';

  @override
  String get customerInfo => 'معلومات العميل';

  @override
  String get items => 'العناصر';

  @override
  String get sneakers => 'أحذية رياضية';

  @override
  String get orderTotal => 'إجمالي الطلب';

  @override
  String get subtotal => 'الإجمالي الفرعي';

  @override
  String get shipping => 'الشحن';

  @override
  String get free => 'مجاني';

  @override
  String get total => 'المجموع';

  @override
  String get checkoutTitle => 'الدفع';

  @override
  String get editDetails => 'تعديل التفاصيل';

  @override
  String get placeOrder => 'إتمام الطلب';

  @override
  String get myCart => 'سلتي';

  @override
  String get cartEmpty => 'سلتك فارغة';

  @override
  String get addCoupon => 'أضف رمز القسيمة';

  @override
  String get couponApplied => 'تم تطبيق القسيمة: خصم 10٪!';

  @override
  String get invalidCoupon => 'رمز القسيمة غير صالح';

  @override
  String get earnPointsFreeShipping => 'ستربح ٣٤ نقطة · شحن مجاني';

  @override
  String get proceedToCheckout => 'المتابعة للدفع';

  @override
  String get productTitle => 'لوريم إيبسوم';

  @override
  String get productBrand => 'من دي ديسولف';

  @override
  String get description => 'الوصف';

  @override
  String get descriptionContent => 'كوريم إيبسوم دولور سيت أميت...';

  @override
  String get ingredients => 'المكونات';

  @override
  String get ingredientsContent => 'ماء، جلسرين، ألوة فيرا...';

  @override
  String get howToUse => 'طريقة الاستخدام';

  @override
  String get howToUseContent => 'ضع كمية صغيرة...';

  @override
  String get inStock => 'متوفر';

  @override
  String get freeDelivery => 'توصيل مجاني';

  @override
  String get availableInStore => 'متوفر في أقرب متجر';

  @override
  String get customerReviews => 'مراجعات العملاء';

  @override
  String get recommendedProducts => 'منتجات قد تعجبك أيضًا';

  @override
  String get addToCart => 'أضف إلى السلة';

  @override
  String get all => 'All';

  @override
  String get electronics => 'Electronics';

  @override
  String get computerSoftware => 'Computer & Software';

  @override
  String get fashion => 'Fashion';

  @override
  String get homeKitchen => 'Home & Kitchen';

  @override
  String get healthBeauty => 'Health & Beauty';

  @override
  String get groceriesFood => 'Groceries & Food';

  @override
  String get childrenToys => 'Children & Toys';

  @override
  String get carsAccessories => 'Cars & Accessories';

  @override
  String get books => 'Books';

  @override
  String get sportsFitness => 'Sports & Fitness';

  @override
  String hiUser(Object user) {
    return 'Hi $user';
  }

  @override
  String get promo => 'Promo';

  @override
  String get exploreProducts => 'Explore thousands of products';

  @override
  String get fastDelivery => 'Fast delivery across the Middle East';

  @override
  String get summerSale => 'Summer sale 50% OFF';

  @override
  String get selectedItems => 'On selected items, limited time!';

  @override
  String get newArrivalsBanner => 'New arrivals are here!';

  @override
  String get freshestStyles => 'Check the freshest styles now';

  @override
  String get bestSeller => 'Best Seller';

  @override
  String get shopByCategory => 'Shop by Category';

  @override
  String get newArrivals => 'New Arrivals';

  @override
  String get productName => 'Forem ipsum';

  @override
  String get discountBanner => '50–40% OFF';

  @override
  String get shopNowText =>
      'On selected products\nShop now with big discounts!';

  @override
  String get shopNow => 'Shop Now';

  @override
  String get home => 'الرئيسية';

  @override
  String get cart => 'السلة';

  @override
  String get chat => 'محادثة';

  @override
  String get howtocontactus => 'كيف تتصل بنا ؟';

  @override
  String get setting => 'الإعدادات';

  @override
  String get buyNow => 'اشتري الان';

  @override
  String get humanFriendlyPolicyText =>
      'المقدمة\nنحن في كولشي لحلول التجارة الإلكترونية، وهي منصة تابعة ومملوكة بالكامل لشركة كولشي إي كومرس والمسجلة رسميًا في دولة الإمارات العربية المتحدة بموجب الترخيص رقم 1401296، والمملوكة من قبل السيد/ أحمد محمد الفرماوي كشخص واحد. يقع المقر الرئيسي للشركة في مكتب رقم 43، مبنى 44، دبي – الإمارات العربية المتحدة.\nنحن نُولي أهمية كبيرة لاحترام خصوصيتك ونسعى لحماية كافة البيانات الشخصية التي يتم جمعها عند استخدامك لموقعنا الإلكتروني\nwww.kolshy.ae\nأو عبر تطبيق الهاتف المحمول المرتبط به.\nلأي استفسارات، يمكنك التواصل معنا عبر:\n•\tالبريد الإلكتروني:  info@kolshy.ae\n•\tالهاتف / واتساب: +971551228825 \n•\tسياسة الخصوصية\n•\tتوضح هذه السياسة (\"سياسة الخصوصية\") الأسس التي نعتمد عليها في جمع بياناتك الشخصية واستخدامها، سواء تم جمعها مباشرة منك أو عبر مصادر أخرى، وذلك في سياق دخولك إلى المنصة أو استخدامك لأي من الخدمات المقدمة من جانبنا، والتي تشمل على سبيل المثال لا الحصر: الرسائل الإعلانية، وخصائص وسائل التواصل الاجتماعي المدمجة في المنصة (ويُشار إلى كل ذلك مجتمِعًا بـ\"الخدمات\").\n•\tنُدرك تمامًا أهمية حماية بياناتك الشخصية، ونلتزم باحترام خصوصيتك والحفاظ عليها.\nنرجو منك قراءة هذه السياسة بعناية لفهم كيفية تعاملنا مع بياناتك الشخصية.\nوباستخدامك للمنصة أو للخدمات، فإنك تُقر وتوافق على جمع واستخدام بياناتك الشخصية وفقًا لما هو موضّح في هذه السياسة.\n•\tلأغراض هذه السياسة، يُقصد بـ \"البيانات الشخصية\" جميع أنواع البيانات المشار إليها في البند (2) من هذه الوثيقة.\n•\tتشير مصطلحات مثل \"المستخدم\"، \"أنت\" أو ما في حكمها، إلى الشخص الطبيعي أو الاعتباري الذي يستخدم المنصة أو الخدمات، بحسب السياق.\n•\tقد تتضمن منصتنا روابط لمواقع إلكترونية تابعة لأطراف خارجية أو مكونات إضافية (Plugins) أو تطبيقات يتم تقديمها من جهات خارجية.\nعند النقر على أي من هذه الروابط أو تفعيل هذه الإضافات، فقد يتمكن الطرف الثالث من جمع معلومات عنك أو مشاركتها.\nنُشير هنا إلى أننا لا نتحكم في سياسات الخصوصية أو ممارسات تلك المواقع الخارجية، ولسنا مسؤولين عنها.\n•\tعند مغادرتك منصتنا، نوصي بشدة أن تقوم بمراجعة سياسة الخصوصية الخاصة بكل موقع إلكتروني تزوره لضمان فهمك الكامل لكيفية تعاملهم مع بياناتك.\n';

  @override
  String get legalMumboJumboPolicyText =>
      '•\t1.عدم جمع بيانات الأطفال\n•\tتم تصميم هذه المنصة للأشخاص البالغين فقط، وفقًا للأنظمة والقوانين المعمول بها التي تحدد سن الرشد.\nولا تستهدف المنصة بأي شكل من الأشكال الأفراد الذين لم يبلغوا السن القانوني.\n•\tومع ذلك، لا يمكننا دائمًا منع بعض المستخدمين، بما في ذلك القُصّر، من تقديم معلومات مضللة بشأن أعمارهم للدخول إلى المنصة.\nإذا كنت ولي أمر أو وصيًا قانونيًا وتعتقد أننا قد جمعنا عن غير قصد معلومات شخصية تخص طفلك، يرجى التواصل معنا فورًا عبر وسائل الاتصال الموضحة في البند 12 من سياسة الخصوصية هذه.\n\n•\t2. ما البيانات الشخصية التي نقوم بجمعها منك أو عنك؟\n•\tنقوم بجمع بياناتك الشخصية بهدف تقديم وتحسين خدماتنا ومنصتنا بشكل مستمر.\nويُقصد بـ\"البيانات الشخصية\" أي معلومات يمكن أن تُستخدم لتحديد هويتك كفرد من خلال أدوات أو مؤشرات تعريف مباشرة أو غير مباشرة.\nولا تشمل البيانات الشخصية أي معلومات تم تحويلها إلى صيغة مجهولة الهوية (أي تلك التي أُزيلت منها وسائل تحديد الهوية الفردية).\n•\tنقوم بجمع وتخزين واستخدام ونقل أنواع متعددة من البيانات الشخصية، والتي يمكن تصنيفها كما يلي:\n•\t1. بيانات الهوية\n•\tتتضمن: الاسم الأول، الاسم الأوسط، اسم العائلة، اسم المستخدم أو أي معرفات مشابهة، الجنس، اللقب، الجنسية، وتاريخ الميلاد.\n•\t2. بيانات الاتصال\n•\tمثل: عنوان الإقامة، عنوان البريد الإلكتروني، ورقم الهاتف.\n•\t3.بيانات المعاملات\n•\tتشمل تفاصيل المدفوعات التي تلقيتها أو أجريتها، وطرق الدفع المستخدمة، إلى جانب بيانات المنتجات أو الخدمات التي تم شراؤها منا.\n•\t4. البيانات التقنية\n•\tمثل: عنوان IP، معلومات تسجيل الدخول، نوع وإصدار المتصفح، نظام التشغيل، إصدار تطبيق الهاتف المحمول، إعدادات المنطقة الزمنية، الموقع الجغرافي، نوع الجهاز، معرفات الإعلانات (مثلًا في نظام iOS)، وغيرها من المعلومات المتعلقة باستخدامك للإنترنت.\nوقد يتم جمع هذه البيانات من خلال تقنيات مثل ملفات تعريف الارتباط (Cookies)، سيشن (sessions)، وإشارات الويب، وغيرها من أدوات التتبع.\n•\t5. بيانات الملف الشخصي\n•\tتتضمن: اسم المستخدم، كلمة المرور، اهتماماتك وتفضيلاتك، التعليقات، اللغة المفضلة، واستجاباتك للاستبيانات.\n•\t6. بيانات الشراء\n•\tتشمل: جميع الطلبات السابقة، عمليات الشراء من حسابك، معلومات الاسترداد، تفاصيل الإنجاز، وسجلات تصفح المنتجات والخدمات.\n•\t7.بيانات التفاعل\n•\tمرتبطة بكيفية تفاعلك مع موقعنا الإلكتروني، منتجاتنا، وخدماتنا.\n•\t8. بيانات التسويق والاتصالات\n•\tتتعلق بتفضيلاتك بشأن تلقي العروض الترويجية أو الرسائل التسويقية منا أو من أطراف خارجية، إلى جانب أسلوب تواصلك المفضل.\n\n•\tبالإضافة إلى ذلك، قد نقوم بجمع واستخدام ومشاركة البيانات الإحصائية أو الديموغرافية المعروفة باسم \"البيانات المجمعة\".\nهذه البيانات مستخلصة من بياناتك الشخصية ولكنها لا تكشف عن هويتك بشكل مباشر أو غير مباشر بعد إزالة كافة أدوات التعريف.\n•\tمثال: يمكننا استخدام بيانات التصفح المجمعة لتحليل النسبة المئوية للمستخدمين الذين يتفاعلون مع ميزة معينة على المنصة.\n\n3.كيف نقوم بجمع بياناتك الشخصية؟\nنقوم بجمع بياناتك الشخصية باستخدام ثلاث طرق رئيسية:\n1. بشكل مباشر منك:\nنجمع بياناتك مباشرة عند استخدامك للمنصة في الحالات التالية:\n•\tعند التسجيل في المنصة أو عبر تسجيل الدخول من خلال شبكات التواصل الاجتماعي أو أي وسيلة تسجيل أخرى.\n•\tعند إجراء عمليات دفع، أو طلب استرداد الأموال، أو تحديد وسيلة الدفع المفضلة.\n•\tعند مشاركتك في المسابقات، العروض الترويجية، أو الاشتراك في برامج ومخططات خاصة.\n•\tعند تقديمك تعليقات، آراء، أو شهادات.\n•\tعند تقديم طلبات دعم أو شكاوى تتعلق بالخدمات، مثل استرجاع الأموال أو حالات الاحتيال أو الاستبدال.\n•\tعند تواصلك معنا عبر الهاتف أو البريد الإلكتروني أو أي وسيلة أخرى، حيث يتم حفظ سجل المراسلات.\n•\tعند تصفحك أو قيامك بأي نشاط آخر داخل المنصة.\n2. بشكل غير مباشر:\nنحصل على بعض بياناتك الشخصية من جهات خارجية أو أطراف ذات علاقة، مثل:\n•\tالأصدقاء أو الأقارب عند قيامهم بعمليات شراء لصالحك أو نيابة عنك.\n•\tالبائعين أو مقدمي الخدمات المتعاونين معنا، مثل:\no\tشركاء الخدمات اللوجستية والتنفيذ.\no\tمقدمي خدمات التسويق.\no\tمقدمي خدمات الدفع.\n•\tتفاعلاتك معنا عبر منصات مثل فيسبوك، جوجل، وغيرها.\nإذا قمت بمشاركة بيانات شخصية لأشخاص آخرين (مثل الأصدقاء أو أفراد العائلة) معنا، فإنك تؤكد أنك حصلت على موافقتهم لمشاركة بياناتهم وفقًا لسياسة الخصوصية.\n3.  بشكل تلقائي:\nنجمع بعض البيانات تلقائيًا أثناء استخدامك للمنصة، باستخدام تقنيات مثل:\n•\tملفات السجل (Log Files): والتي تشمل معلومات مثل عنوان IP، نوع المتصفح، الصفحات التي زرتها، نظام التشغيل، التوقيتات، وغير ذلك من البيانات الفنية.\n•\tملفات تعريف الارتباط (Cookies&sessions): وهي ملفات صغيرة يتم حفظها على جهازك لتحسين تجربتك من خلال:\no\tتفعيل مزايا معينة في المنصة.\no\tتذكر تفضيلاتك وسلوكك السابق.\no\tفهم طريقة تفاعلك مع المنصة.\no\tعرض إعلانات مخصصة داخل المنصة وخارجها.\no\tتحليل حركة الزوار وتحسين الخدمات.\nإذا لم توافق على استخدام ملفات تعريف الارتباط، يمكنك تعطيلها من خلال إعدادات متصفحك، أو التوقف عن استخدام المنصة. ولكن يُرجى ملاحظة أن تعطيل بعض أنواع البيانات قد يؤثر على تجربتك معنا والاستفادة الكاملة من الخدمات.\n\n4.ما هو الغرض من جمع بياناتك الشخصية؟\nنقوم بجمع واستخدام بياناتك الشخصية لعدة أهداف تهدف إلى تحسين تجربتك معنا، وتشمل ما يلي:\n1.تقديم المعلومات والخدمات:\nنستخدم بياناتك لتزويدك بالمعلومات أو المنتجات أو الخدمات التي تطلبها، أو التي نعتقد أنها قد تهمك — إذا وافقت على أن يتم التواصل معك لهذا الغرض.\n2.خدمات الموقع الجغرافي:\nلتمكينك من الوصول إلى محتوى مخصص بناءً على موقعك، مثل الإعلانات ونتائج البحث والمحتويات ذات الصلةوايضا توصيل المنتجات.\n3.تنفيذ الالتزامات التعاقدية:\nإذا كنت طرفًا في عقد معنا أو مع جهة أخرى من خلال منصتنا، نستخدم بياناتك للوفاء بهذه الالتزامات.\n4.تحسين التواصل والخدمات:\nلتحسين خدماتنا وتخصيصها لك بشكل أفضل، والتواصل معك من خلال الهاتف، البريد الإلكتروني، الرسائل النصية، أو تطبيقات المراسلة الفورية.\n5.عرض المحتوى بأفضل صورة:\nلضمان أن يتم تقديم محتوى المنصة بأفضل شكل يناسبك ويناسب جهازك.\n6.مناسباتك الخاصة:\nلتقديم عروض وخدمات مخصصة في مناسباتك المميزة، مثل عيد ميلادك أو ذكرياتك السنوية.\n7.إبلاغك بالتحديثات:\nلإعلامك بأي تغييرات أو تحديثات تطرأ على خدماتنا.\n8.تحسين تجربتك بشكل عام:\nأي استخدام آخر نراه ضروريًا لتحسين تجربتك وتطوير خدمات المنصة.\n9.إدارة برامج المكافآت:\nلإدارة وتنظيم برامج الحوافز والسحب على الجوائز، ومعالجة طلباتك الخاصة بها، وإبلاغك في حال فوزك.\n10. تحسين الأداء الفني:\nلضمان أفضل أداء ممكن للمنصة، بما في ذلك إصلاح الأعطال وتحليل الأداء وتحسين تجربة الاستخدام.\n11.الامتثال للقوانين المحلية:\nمثل استخدام بيانات جنسيتك لتسهيل الشحن عبر الحدود، أو معلوماتك البنكية للتحقق من الهوية.\n12.منع الاحتيال وضمان الأمان:\nلرصد ومنع أي أنشطة احتيالية أو سوء استخدام، وضمان حماية بياناتك وبيانات المستخدمين الآخرين.\n5.كيف نستخدم بياناتك الشخصية؟\nنلتزم باستخدام بياناتك الشخصية فقط في الحالات والظروف التي تستدعي ذلك، وتشمل ما يلي:\n1. تنفيذ العقود:\nنقوم باستخدام بياناتك من أجل تنفيذ أي عقد مبرم بيننا وبينك، أو لاتخاذ الخطوات اللازمة قبل توقيع العقد — مثل قبول الشروط والأحكام الخاصة بنا أو أي شروط إضافية متعلقة بالخدمات.\nإذا لم تزودنا ببياناتك، فقد لا نتمكن من تقديم الخدمات أو إتمام العقد، مما قد يؤدي إلى إلغاء الخدمة، وسنقوم بإبلاغك بذلك في حال حدوثه.\n2.الامتثال للأنظمة واللوائح:\nقد نُطلب قانونيًا إلى جمع واستخدام بياناتك الشخصية من أجل الامتثال للأنظمة والقوانين المعمول بها.\n3.المصالح المشروعة:\nفي بعض الحالات، نعتمد على مصالحنا المشروعة أو مصالح عملائنا في معالجة بياناتك، مثل:\n•\tتحسين جودة الخدمات وتطويرها.\n•\tالكشف عن الأنشطة الاحتيالية ومنع إساءة الاستخدام.\n•\tتعزيز الأمان لك ولجميع مستخدمي المنصة.\n•\tتقديم إعلانات مخصصة بناءً على اهتماماتك.\n4.التسويق والتواصل:\nقد نستخدم بياناتك لتقديم معلومات عن منتجات وخدمات قد تهمك، ولدعم تجربتك معنا من خلال:\n•\tرسائل الخدمة.\n•\tالتنبيهات حول المزايا والتحسينات الجديدة.\n•\tعروض خاصة وفعاليات.\n•\tالإشعارات على قنوات متعددة مثل البريد الإلكتروني، التنبيهات الفورية، إشعارات الويب، الرسائل داخل التطبيق، المكالمات، رسائل واتساب، أو حتى موجز الأخبار.\nوإذا لم تكن ترغب في تلقي هذا النوع من الرسائل، يمكنك بكل سهولة:\n•\tالنقر على زر \"إلغاء الاشتراك\" الموجود في أي بريد إلكتروني تسويقي.\n•\tإرسال كلمة \"إيقاف\" عبر الرسائل النصية أو واتساب.\n•\tأو التواصل معنا عبر التفاصيل الموضحة في البند 11 من سياسة الخصوصية.\n6.مع من نشارك بياناتك الشخصية؟\nنحن نُقدّر خصوصيتك، وبياناتك الشخصية تهمّنا جدًا. لا نشاركها مع أي طرف دون سبب واضح، ونفعل ذلك فقط في الحالات التالية، ومع جهات تلتزم بمعايير حماية بيانات لا تقل عن تلك المذكورة في سياسة الخصوصية هذه:\n1.شركاتنا التابعة ومزودو الخدمات:\nلضمان تقديم خدماتنا بكفاءة، قد نشارك بياناتك مع:\n•\tشركات لوجستية لتوصيل الطلبات.\n•\tشركات تسويق لتقديم عروض مخصصة.\n•\tمزودي خدمات الدفع لإتمام المعاملات الإلكترونية.\n•\tشركات تحليل البيانات أو المحفظة الرقمية لتحسين تجربتك.\nكل هذه الجهات تلتزم باستخدام بياناتك فقط لما تم الاتفاق عليه ولا تستخدمها لأغراضها الخاصة.\n2. الجهات الخارجية:\nقد نشارك بياناتك مع أطراف خارجية لأغراض محددة، مثل:\n•\tتنفيذ الخدمات.\n•\tتنظيم المسابقات أو العروض الترويجية.\n•\tأبحاث السوق (بموافقتك).\nإذا لم ترغب في المشاركة، يمكنك ببساطة عدم تقديم بيانات إضافية. وإذا قررت المشاركة، يُرجى مراجعة سياسات الخصوصية لتلك الجهات لفهم كيفية استخدامهم للبيانات.\nيمكنك في أي وقت إيقاف تلقي الاتصالات التسويقية عبر:\n•\tتعديل إعدادات التسويق في حسابك.\n•\tالنقر على \"إلغاء الاشتراك\" في أي رسالة تسويقية.\n•\tأو مراسلتنا على:\nsupport@kolshy.ae\n3. في حال نقل الملكية أو الاندماج:\nإذا تم دمج شركتنا أو بيع جزء من أصولها، فقد يتم نقل بيانات العملاء كجزء من الصفقة، مع استمرار الالتزام بحماية البيانات حسب السياسة الحالية (ما لم توافق أنت على خلاف ذلك).\n4. الامتثال القانوني وحماية الحقوق:\nقد نُفصح عن بياناتك إذا تطلب الأمر ذلك قانونيًا، أو لحماية:\n•\tحقوقنا وحقوق مستخدمينا.\n•\tالملكية أو السلامة العامة.\n•\tمنع الاحتيال وتقليل مخاطر الائتمان.\nويشمل ذلك التعاون مع جهات إنفاذ القانون أو كيانات أخرى لأغراض أمنية.\n\n7.كيف نقوم بتخزين بياناتك الشخصية؟ وكم نحتفظ بها؟\nقد يتم نقل وتخزين ومعالجة بياناتك الشخصية من قبل موظفينا أو من قِبل مزودي الخدمات الذين نتعاون معهم. ويشمل دور هؤلاء الموظفين، على سبيل المثال لا الحصر: تنفيذ طلباتك، معالجة مدفوعاتك، وتقديم خدمات الدعم الفني وخدمة العملاء.\nنقوم بتخزين بياناتك الشخصية فقط للمدة اللازمة لتحقيق الأغراض الموضحة في سياسة الخصوصية هذه، أو كما يجيزه أو يتطلبه القانون.\nعند تحديد مدة الاحتفاظ ببياناتك، نأخذ بعين الاعتبار الأمور التالية:\n•\tكمية البيانات وطبيعتها ومدى حساسيتها.\n•\tمستوى الخطورة المرتبط بأي استخدام غير مصرح به أو إفصاح عنها.\n•\tأهداف استخدام البيانات، وهل يمكن تحقيقها بطريقة بديلة دون الحاجة للاحتفاظ بها.\n•\tالمتطلبات القانونية والتنظيمية والضريبية والمحاسبية المعمول بها.\nوفي بعض الحالات، قد نقوم بتحويل بياناتك إلى بيانات مجهولة المصدر لا يمكن ربطها بهويتك. وفي هذه الحالة، يمكننا استخدامها لأغراض البحث أو التحليل الإحصائي إلى أجل غير مسمى دون إشعارك، كونها لم تعد ترتبط بك بشكل مباشر.\n\n8.ما هي التدابير الأمنية التي نُطبقها لحماية بياناتك الشخصية؟\nنحن نضع أمنك وخصوصيتك على رأس أولوياتنا، وقد صممنا أنظمتنا لتوفر حماية قوية لبياناتك من اليوم الأول.\nنُطبق مجموعة من التدابير الفنية والإدارية والمادية المعقولة والمعتمدة تجاريًا لضمان أن بياناتك الشخصية:\n•\tتُعالج بأمان.\n•\tمحفوظة بما يتماشى مع سياسة الخصوصية والقوانين المعمول بها.\n•\tمحمية من الوصول غير المصرح به أو التعديل أو الإفصاح أو التلف.\nبعض الإجراءات التي نطبقها تشمل:\n•\tتشفير البيانات أثناء نقلها إلى منصتنا لضمان عدم قراءتها من قبل أطراف غير مصرح لها.\n•\tاستخدام جدران حماية متقدمة على مستوى الشبكة وعلى مستوى الخوادم لمنع أي هجمات إلكترونية.\n•\tتقييد الوصول إلى بياناتك على الموظفين أو المتعاقدين أو الوكلاء المخوّلين فقط، والذين يحتاجون لهذه البيانات لأداء مهامهم.\n•\tالامتثال لمعيار أمن بيانات صناعة بطاقات الدفع (PCI DSS) عند معالجة معلومات بطاقات الائتمان.\nمسؤوليتك أيضًا مهمة!\nنحثك على اتخاذ خطوات لحماية معلوماتك، مثل:\n•\tالحفاظ على سرية كلمة المرور الخاصة بك.\n•\tتسجيل الخروج دائمًا عند استخدام جهاز مشترك.\nلأننا، رغم حرصنا الكبير، لا يمكننا ضمان الأمان الكامل للمعلومات أثناء نقلها عبر الإنترنت، كونه مجالًا لا يخلو من المخاطر.\n\n9.ما هي حقوقك المتعلقة ببياناتك الشخصية؟\nفي بعض الحالات، يحق لك التمتع بعدة حقوق تتعلق ببياناتك الشخصية، وتشمل ما يلي:\n1. الحق في الحصول على معلومات حول بياناتك الشخصية\nلك الحق في معرفة كيفية جمع واستخدام بياناتك الشخصية. وإذا كانت لديك أي استفسارات بهذا الخصوص، يرجى التواصل معنا عبر البريد الإلكتروني:\nsupport@kolshy.ae\nكما تتضمن العديد من خدماتنا إعدادات تتيح لك إمكانية اختيار الطريقة التي تتم بها معالجة بياناتك.\n2. الحق في الوصول إلى بياناتك الشخصية\nيمكنك الاطلاع على مجموعة واسعة من المعلومات المرتبطة بحسابك وتفاعلاتك داخل المنصة، وذلك بهدف مراجعة بياناتك الشخصية وتحديثها عند الحاجة. ومن أمثلة هذه البيانات:\n•\tتفاصيل الطلبات الأخيرة.\n•\tالمعلومات التعريفية (مثل الاسم، البريد الإلكتروني، كلمة المرور، تاريخ الميلاد، بيانات الاتصال، وتفضيلات الإعلانات).\n•\tمعلومات الدفع (بما في ذلك بيانات بطاقة الائتمان).\n•\tإعدادات إشعارات البريد الإلكتروني.\nلمزيد من التفاصيل، يمكن التواصل معنا عبر:\nsupport@kolshy.ae\n3.الحق في طلب حذف البيانات\nيحق لك طلب حذف بياناتك الشخصية، ضمن الحدود التي يسمح بها القانون المعمول به. للتقدم بهذا الطلب، يُرجى التواصل مع خدمة العملاء.\nمع العلم أنه قد يتعذر الاستجابة لهذا الطلب في بعض الحالات لأسباب قانونية واضحة سيتم إعلامك بها في حال حدوث ذلك.\n4. الحق في سحب الموافقة أو الاعتراض\nيمكنك في أي وقت سحب موافقتك المتعلقة باستلام الرسائل التسويقية، وذلك من خلال ضبط تفضيلات التواصل الخاصة بك، أو عبر رابط إلغاء الاشتراك الموجود في رسائل البريد الإلكتروني.\nكما يمكنك أيضًا تعطيل ملفات تعريف الارتباط من خلال إعدادات المتصفح، إلا أن ذلك قد يؤثر على بعض ميزات المنصة أو يقيّد الوصول إليها.\n6. الحق في تصحيح البيانات\nإذا لاحظت وجود أي أخطاء أو معلومات غير دقيقة في بياناتك الشخصية، يمكنك في أي وقت طلب تعديلها من خلال التواصل معنا على:\nsupport@kolshy.ae\n7. الرسوم الزمنية والمقابل\nلن تُطلب منك أي رسوم مقابل ممارسة حقوقك، إلا إذا نصّ القانون على خلاف ذلك. وإذا قمت بتقديم طلب لممارسة أي من حقوقك، فسنقوم بالرد عليك ضمن الفترة الزمنية المحددة قانونيًا.\n\n10.كيف نقوم بتحديث سياسة الخصوصية؟\nنظراً لأن طبيعة عملنا قد تتغير من وقت لآخر، فقد نحتاج أيضاً إلى تحديث سياسة الخصوصية لتواكب هذه التغيرات. في حال حدوث أي تعديل، سنقوم بعرض النسخة المحدثة على منصتنا، وسيُعتبر هذا التعديل ساريًا إما فور نشره أو في التاريخ الذي نوضحه كتاريخ بدء العمل به.\nفي بعض الأحيان، قد نرسل إليك رسائل بريد إلكتروني لتذكيرك بالتعديلات أو بالشروط المتعلقة بسياساتنا، ومع ذلك، نوصيك بالاطلاع بشكل دوري على المنصة للاطلاع على آخر المستجدات.\nيُعد استمرار استخدامك للمنصة بعد نشر أي تحديث بمثابة موافقة ضمنية على سياسة الخصوصية بصيغتها الجديدة، لذلك فإن مراجعتك المنتظمة تظل مسؤوليتك الشخصية.\n11.تواصل معنا\n📞 لأي استفسار إضافي، يسعدنا خدمتك عبر قنواتنا التالية:\n•\tواتساب : +971551228825\n•\tالبريد الإلكتروني   info@kolshy.ae: \nيفضّل توضيح التفاصيل في رسالتك علشان نقدر نساعدك بشكل أسرع وأدق.\n';
}